ART-Badge/SDK/bsp_for_art-badge/libraries/inc/peripheral/rtl876x_gdma.h
/**
*********************************************************************************************************
*               Copyright(c) 2019, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl876x_gdma.h
* \brief    The header file of the peripheral GDMA driver.
* \details  This file provides all GDMA firmware functions.
* \author   yuan
* \date     2019-11-14
* \version  v1.0
* *********************************************************************************************************
*/

#ifndef _RTL876X_GDMA_H_
#define _RTL876X_GDMA_H_

#ifdef __cplusplus
extern "C" {
#endif

/**
 * \addtogroup  IO          Peripheral Drivers
 * \defgroup    GDMA        GDMA
 *
 * \brief       Manage the GDMA peripheral functions.
 *
 * \ingroup     IO
 */

/*============================================================================*
 *                         Includes
 *============================================================================*/
#include "rtl876x.h"

/*============================================================================*
 *                         Types
 *============================================================================*/

/**
 * \defgroup    GDMA_Exported_Types Init Params Struct
 *
 * \ingroup     GDMA
 */

/**
 * \brief       GDMA init structure definition.
 *
 * \ingroup     GDMA_Exported_Types
 */
typedef struct
{
    uint8_t GDMA_ChannelNum;        /*!< Specifies channel number for GDMA. */
    uint8_t GDMA_DIR;               /*!< Specifies if the peripheral is the source or destination.
                                            This parameter can be a value of \ref GDMA_Data_Transfer_Direction. */
    uint32_t GDMA_BufferSize;       /*!< Specifies the buffer size(<=4095), in data unit, of the specified Channel.
                                            The data unit is equal to the configuration set in DMA_PeripheralDataSize
                                            or DMA_MemoryDataSize members depending in the transfer direction. */
    uint8_t GDMA_SourceInc;         /*!< Specifies whether the source address register is incremented or not.
                                            This parameter can be a value of \ref GDMA_Source_Incremented_Mode */

    uint8_t GDMA_DestinationInc;    /*!< Specifies whether the destination address register is incremented or not.
                                            This parameter can be a value of \ref GDMA_Destination_Incremented_Mode. */
    uint32_t GDMA_SourceDataSize;   /*!< Specifies the source data width.
                                            This parameter can be a value of \ref GDMA_Data_Size */
    uint32_t GDMA_DestinationDataSize; /*!< Specifies the Memory data width.
                                            This parameter can be a value of \ref GDMA_Data_Size */
    uint32_t GDMA_SourceMsize;      /*!< Specifies the number of data items to be transferred.
                                            This parameter can be a value of \ref GDMA_Msize */
    uint32_t GDMA_DestinationMsize; /*!< Specifies  the number of data items to be transferred.
                                            This parameter can be a value of \ref GDMA_Msize */
    uint32_t GDMA_SourceAddr;       /*!< Specifies the source base address for GDMA Channelx. */
    uint32_t GDMA_DestinationAddr;  /*!< Specifies the destination base address for GDMA Channelx. */
    uint32_t GDMA_ChannelPriority;  /*!< Specifies the software priority for the GDMA Channelx. */

    uint32_t GDMA_Multi_Block_Mode; /*!< Specifies the multi block transfer mode.
                                            This parameter can be a value of \ref GDMA_Multiblock_Mode. */
    uint32_t GDMA_Multi_Block_Struct; /*!< Pointer to the first struct of LLI. */
    uint8_t  GDMA_Multi_Block_En;   /*!< Enable or disable multi-block function. */
    uint8_t  GDMA_Gather_En;        /*!< Enable or disable Gather function. NOTE:4 bytes ALIGN. */
    uint8_t  GDMA_Scatter_En;       /*!< Enable or disable Scatter function. */
    uint32_t GDMA_GatherCount;      /*!< Specifies the GatherCount.NOTE:4 bytes ALIGN.*/
    uint32_t GDMA_GatherInterval;   /*!< Specifies the GatherInterval. */
    uint32_t GDMA_ScatterCount;     /*!< Specifies the ScatterCount. */
    uint32_t GDMA_ScatterInterval;  /*!< Specifies the ScatterInterval. */
    uint8_t  GDMA_SourceHandshake;  /*!< Specifies the handshake index in source.
                                            This parameter can be a value of \ref GDMA_Handshake_Type. */
    uint8_t  GDMA_DestHandshake;    /*!< Specifies the handshake index in Destination.
                                            This parameter can be a value of \ref GDMA_Handshake_Type. */

} GDMA_InitTypeDef;

/**
 * \brief       GDMA link list item structure definition.
 *
 * \ingroup     GDMA_Exported_Types
 */
typedef struct
{
    __IO uint32_t SAR;
    __IO uint32_t DAR;
    __IO uint32_t LLP;
    __IO uint32_t CTL_LOW;
    __IO uint32_t CTL_HIGH;
} GDMA_LLIDef;


/*============================================================================*
 *                         Constants
 *============================================================================*/

/**
 * \defgroup    GDMA_Exported_Constants Macro Definitions
 *
 * \ingroup     GDMA
 */

#define IS_GDMA_ALL_PERIPH(PERIPH) (((PERIPH) == GDMA_Channel0) || \
                                    ((PERIPH) == GDMA_Channel1) || \
                                    ((PERIPH) == GDMA_Channel2) || \
                                    ((PERIPH) == GDMA_Channel3) || \
                                    ((PERIPH) == GDMA_Channel4) || \
                                    ((PERIPH) == GDMA_Channel5))

#define IS_GDMA_ChannelNum(NUM) ((NUM) < 8)

/**
 * \defgroup    GDMA_Handshake_Type GDMA Handshake Type
 * \{
 * \ingroup     GDMA_Exported_Constants
 */
#define GDMA_Handshake_UART0_TX             (0)
#define GDMA_Handshake_UART0_RX             (1)
#define GDMA_Handshake_UART2_TX             (2)
#define GDMA_Handshake_UART2_RX             (3)
#define GDMA_Handshake_SPI0_TX              (4)
#define GDMA_Handshake_SPI0_RX              (5)
#define GDMA_Handshake_SPI1_TX              (6)
#define GDMA_Handshake_SPI1_RX              (7)
#define GDMA_Handshake_I2C0_TX              (8)
#define GDMA_Handshake_I2C0_RX              (9)
#define GDMA_Handshake_I2C1_TX              (10)
#define GDMA_Handshake_I2C1_RX              (11)
#define GDMA_Handshake_ADC                  (12)
#define GDMA_Handshake_AES_TX               (13)
#define GDMA_Handshake_AES_RX               (14)
#define GDMA_Handshake_UART1_TX             (15)
#define GDMA_Handshake_I2S0_TX              (16)
#define GDMA_Handshake_I2S0_RX              (17)
#define GDMA_Handshake_I2S1_TX              (18)
#define GDMA_Handshake_I2S1_RX              (19)
#define GDMA_Handshake_SPIC0_TX             (20)
#define GDMA_Handshake_SPIC0_RX             (21)
#define GDMA_Handshake_8080_TX              (22)
#define GDMA_Handshake_SPIC2_TX             (22)
#define GDMA_Handshake_UART1_RX             (23)
#define GDMA_Handshake_SPIC1_TX             (24)
#define GDMA_Handshake_SPIC1_RX             (25)
#define GDMA_Handshake_8080_RX              (26)
#define GDMA_Handshake_SPIC2_RX             (26)
#define GDMA_Handshake_IR_TX                (27)
#define GDMA_Handshake_IR_RX                (28)
#define GDMA_Handshake_TIM5                 (29)
#define GDMA_Handshake_TIM6                 (30)
#define GDMA_Handshake_TIM7                 (31)
/** \} */

#define IS_GDMA_TransferType(Type) (((Type) == GDMA_Handshake_UART0_TX) || \
                                    ((Type) == GDMA_Handshake_UART0_RX) || \
                                    ((Type) == GDMA_Handshake_UART2_TX) || \
                                    ((Type) == GDMA_Handshake_UART2_RX) || \
                                    ((Type) == GDMA_Handshake_SPI0_TX) || \
                                    ((Type) == GDMA_Handshake_SPI0_RX) || \
                                    ((Type) == GDMA_Handshake_SPI1_TX) || \
                                    ((Type) == GDMA_Handshake_SPI1_RX) || \
                                    ((Type) == GDMA_Handshake_I2C0_TX) || \
                                    ((Type) == GDMA_Handshake_I2C0_RX) || \
                                    ((Type) == GDMA_Handshake_I2C1_TX) || \
                                    ((Type) == GDMA_Handshake_I2C1_RX) || \
                                    ((Type) == GDMA_Handshake_ADC) || \
                                    ((Type) == GDMA_Handshake_AES_TX) || \
                                    ((Type) == GDMA_Handshake_AES_RX) || \
                                    ((Type) == GDMA_Handshake_UART1_TX) || \
                                    ((Type) == GDMA_Handshake_SPORT0_TX) || \
                                    ((Type) == GDMA_Handshake_SPORT0_RX) || \
                                    ((Type) == GDMA_Handshake_SPORT1_TX) || \
                                    ((Type) == GDMA_Handshake_SPORT1_RX) || \
                                    ((Type) == GDMA_Handshake_SPIC_TX) || \
                                    ((Type) == GDMA_Handshake_SPIC_RX) ||\
                                    ((Type) == GDMA_Handshake_LCD) ||\
                                    ((Type) == GDMA_Handshake_TIM0)||\
                                    ((Type) == GDMA_Handshake_TIM1)||\
                                    ((Type) == GDMA_Handshake_TIM2)||\
                                    ((Type) == GDMA_Handshake_TIM3)||\
                                    ((Type) == GDMA_Handshake_TIM4)||\
                                    ((Type) == GDMA_Handshake_TIM5)||\
                                    ((Type) == GDMA_Handshake_TIM6)||\
                                    ((Type) == GDMA_Handshake_TIM7))

/**
 * \defgroup    GDMA_Data_Size GDMA Data Size
 * \{
 * \ingroup     GDMA_Exported_Constants
 */
#define GDMA_DataSize_Byte                  ((uint32_t)0x00000000)
#define GDMA_DataSize_HalfWord              ((uint32_t)0x00000001)
#define GDMA_DataSize_Word                  ((uint32_t)0x00000002)
/** \} */

#define IS_GDMA_DATA_SIZE(SIZE) (((SIZE) == GDMA_DataSize_Byte) || \
                                 ((SIZE) == GDMA_DataSize_HalfWord) || \
                                 ((SIZE) == GDMA_DataSize_Word))

/**
 * \defgroup    GDMA_Msize GDMA Msize
 * \{
 * \ingroup     GDMA_Exported_Constants
 */
#define GDMA_Msize_1                        ((uint32_t)0x00000000)
#define GDMA_Msize_4                        ((uint32_t)0x00000001)
#define GDMA_Msize_8                        ((uint32_t)0x00000002)
#define GDMA_Msize_16                       ((uint32_t)0x00000003)
#define GDMA_Msize_32                       ((uint32_t)0x00000004)
#define GDMA_Msize_64                       ((uint32_t)0x00000005)
#define GDMA_Msize_128                      ((uint32_t)0x00000006)
#define GDMA_Msize_256                      ((uint32_t)0x00000007)
/** \} */
#define IS_GDMA_MSIZE(SIZE) (((SIZE) == GDMA_Msize_1) || \
                             ((SIZE) == GDMA_Msize_4) || \
                             ((SIZE) == GDMA_Msize_8) || \
                             ((SIZE) == GDMA_Msize_16) || \
                             ((SIZE) == GDMA_Msize_32) || \
                             ((SIZE) == GDMA_Msize_64) || \
                             ((SIZE) == GDMA_Msize_128) || \
                             ((SIZE) == GDMA_Msize_256))

/**
 * \defgroup    GDMA_Data_Transfer_Direction GDMA Data Transfer Direction
 * \{
 * \ingroup     GDMA_Exported_Constants
 */
#define GDMA_DIR_MemoryToMemory              ((uint32_t)0x00000000)
#define GDMA_DIR_MemoryToPeripheral          ((uint32_t)0x00000001)
#define GDMA_DIR_PeripheralToMemory          ((uint32_t)0x00000002)
#define GDMA_DIR_PeripheralToPeripheral      ((uint32_t)0x00000003)
/** \} */

#define IS_GDMA_DIR(DIR) (((DIR) == GDMA_DIR_MemoryToMemory) || \
                          ((DIR) == GDMA_DIR_MemoryToPeripheral) || \
                          ((DIR) == GDMA_DIR_PeripheralToMemory) ||\
                          ((DIR) == GDMA_DIR_PeripheralToPeripheral))

/**
 * \defgroup    GDMA_Source_Incremented_Mode GDMA Source Incremented Mode
 * \{
 * \ingroup     GDMA_Exported_Constants
 */
#define DMA_SourceInc_Inc                   ((uint32_t)0x00000000)
#define DMA_SourceInc_Dec                   ((uint32_t)0x00000001)
#define DMA_SourceInc_Fix                   ((uint32_t)0x00000002)
/** \} */

