ART-Badge/SDK/bsp_for_art-badge/libraries/inc/peripheral/rtl876x_gdma.h
#define IS_GDMA_SourceInc(STATE) (((STATE) == DMA_SourceInc_Inc) || \
                                  ((STATE) == DMA_SourceInc_Dec) || \
                                  ((STATE) == DMA_SourceInc_Fix))

/**
 * \defgroup    GDMA_Destination_Incremented_Mode GDMA Destination Incremented Mode
 * \{
 * \ingroup     GDMA_Exported_Constants
 */
#define DMA_DestinationInc_Inc              ((uint32_t)0x00000000)
#define DMA_DestinationInc_Dec              ((uint32_t)0x00000001)
#define DMA_DestinationInc_Fix              ((uint32_t)0x00000002)
/** \} */

#define IS_GDMA_DestinationInc(STATE) (((STATE) == DMA_DestinationInc_Inc) || \
                                       ((STATE) == DMA_DestinationInc_Dec) || \
                                       ((STATE) == DMA_DestinationInc_Fix))

/**
 * \defgroup    DMA_Interrupts_Definition DMA Interrupts Definition
 * \{
 * \ingroup     GDMA_Exported_Constants
 */
#define GDMA_INT_Transfer                   ((uint32_t)0x00000001)
#define GDMA_INT_Block                      ((uint32_t)0x00000002)
#define GDMA_INT_SrcTransfer                ((uint32_t)0x00000004)
#define GDMA_INT_DstTransfer                ((uint32_t)0x00000008)
#define GDMA_INT_Error                      ((uint32_t)0x00000010)
/** \} */

#define IS_GDMA_CONFIG_IT(IT) ((((IT) & 0xFFFFFE00) == 0x00) && ((IT) != 0x00))

/**
 * \defgroup    GDMA_Multiblock_Mode GDMA Multi-block Mode
 * \{
 * \ingroup     GDMA_Exported_Constants
 */
#define AUTO_RELOAD_WITH_CONTIGUOUS_SAR     (BIT30)
#define AUTO_RELOAD_WITH_CONTIGUOUS_DAR     (BIT31)
#define AUTO_RELOAD_TRANSFER                (BIT30 | BIT31)
#define LLI_WITH_CONTIGUOUS_SAR             (BIT27)
#define LLI_WITH_AUTO_RELOAD_SAR            (BIT27 | BIT30)
#define LLI_WITH_CONTIGUOUS_DAR             (BIT28)
#define LLI_WITH_AUTO_RELOAD_DAR            (BIT28 | BIT31)
#define LLI_TRANSFER                        (BIT27 | BIT28)
/** \} */

#define IS_GDMA_MULTIBLOCKMODE(MODE) (((MODE) == AUTO_RELOAD_WITH_CONTIGUOUS_SAR) || ((MODE) == AUTO_RELOAD_WITH_CONTIGUOUS_DAR)\
                                      ||((MODE) == AUTO_RELOAD_TRANSFER) || ((MODE) == LLI_WITH_CONTIGUOUS_SAR)\
                                      ||((MODE) == LLI_WITH_AUTO_RELOAD_SAR) || ((MODE) == LLI_WITH_CONTIGUOUS_DAR)\
                                      ||((MODE) == LLI_WITH_AUTO_RELOAD_DAR) || ((MODE) == LLI_TRANSFER))

/**
 * \def GDMA_Multiblock_Select_Bit Multi-Block Select Bit
 *
 */
#define AUTO_RELOAD_SELECTED_BIT            (uint32_t)(0xC0000000)
#define LLP_SELECTED_BIT                    (uint32_t)(0x18000000)

/**
 * \def DMA_Suspend_Flag_Definition DMA Suspend Flag Definition
 */
#define GDMA_FIFO_STATUS                    (BIT(9))
#define GDMA_SUSPEND_TRANSMISSSION          (BIT(8))
#define GDMA_SUSPEND_CMD_STATUS             (BIT(2) | BIT(1))
#define GDMA_SUSPEND_CHANNEL_STATUS         (BIT(0))


/*============================================================================*
 *                         Functions
 *============================================================================*/

/**
 * \defgroup    GDMA_Exported_Functions Peripheral APIs
 * \{
 * \ingroup     GDMA
 */

/**
 * \brief  Deinitializes the GDMA registers to their default reset
 *         values.
 * \param  None.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_gdma_init(void)
 * {
 *     GDMA_DeInit();
 * }
 * \endcode
 */
void GDMA_DeInit(void);

/**
 * \brief  Initializes the GDMA Channelx according to the specified
 *         parameters in the GDMA_InitStruct.
 * \param[in] GDMA_Channelx: Where x can be 0 to 7  to select the DMA Channel.
 * \param[in] GDMA_InitStruct: Pointer to a GDMA_InitTypeDef structure that
 *            contains the configuration information for the specified DMA Channel.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_gdma_init(void)
 * {
 *
 *     for (uint32_t i = 0; i < UART_TX_GDMA_BUFFER_SIZE; i++)
 *     {
 *         GDMA_SendData_Buffer[i] = 0x10 + i;
 *     }

 *     GDMA_InitTypeDef GDMA_InitStruct;
 *     GDMA_StructInit(&GDMA_InitStruct);
 *     GDMA_InitStruct.GDMA_ChannelNum      = 1;
 *     GDMA_InitStruct.GDMA_DIR             = GDMA_DIR_MemoryToPeripheral;
 *     GDMA_InitStruct.GDMA_BufferSize      = UART_TX_GDMA_BUFFER_SIZE;//determine total transfer size
 *     GDMA_InitStruct.GDMA_SourceInc       = DMA_SourceInc_Inc;
 *     GDMA_InitStruct.GDMA_DestinationInc  = DMA_DestinationInc_Fix;
 *     GDMA_InitStruct.GDMA_SourceDataSize  = GDMA_DataSize_Byte;
 *     GDMA_InitStruct.GDMA_DestinationDataSize = GDMA_DataSize_Byte;
 *     GDMA_InitStruct.GDMA_SourceMsize      = GDMA_Msize_1;
 *     GDMA_InitStruct.GDMA_DestinationMsize = GDMA_Msize_1;
 *     GDMA_InitStruct.GDMA_SourceAddr      = (uint32_t)GDMA_SendData_Buffer;
 *     GDMA_InitStruct.GDMA_DestinationAddr = (uint32_t)(&(UART0->RB_THR));
 *     GDMA_InitStruct.GDMA_DestHandshake   = GDMA_Handshake_UART0_TX;
 *     GDMA_InitStruct.GDMA_ChannelPriority = 2;//channel prority between 0 to 5
 *     GDMA_Init(UART_TX_GDMA_CHANNEL, &GDMA_InitStruct);

 *     GDMA_INTConfig(UART_TX_GDMA_CHANNEL_NUM, GDMA_INT_Transfer, ENABLE);

 *     NVIC_InitTypeDef NVIC_InitStruct;
 *     NVIC_InitStruct.NVIC_IRQChannel = UART_TX_GDMA_CHANNEL_IRQN;
 *     NVIC_InitStruct.NVIC_IRQChannelPriority = 3;
 *     NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
 *     NVIC_Init(&NVIC_InitStruct);

 *     GDMA_Cmd(UART_TX_GDMA_CHANNEL_NUM, ENABLE);
 * }
 * \endcode
 */
void GDMA_Init(GDMA_ChannelTypeDef *GDMA_Channelx, GDMA_InitTypeDef *GDMA_InitStruct);

/**
 * \brief  Fills each GDMA_InitStruct member with its default value.
 * \param[in]  GDMA_InitStruct : pointer to a GDMA_InitTypeDef structure which will
 *         be initialized.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_gdma_init(void)
 * {
 *
 *     for (uint32_t i = 0; i < UART_TX_GDMA_BUFFER_SIZE; i++)
 *     {
 *         GDMA_SendData_Buffer[i] = 0x10 + i;
 *     }

 *     GDMA_InitTypeDef GDMA_InitStruct;
 *     GDMA_StructInit(&GDMA_InitStruct);
 *     GDMA_InitStruct.GDMA_ChannelNum      = 1;
 *     GDMA_InitStruct.GDMA_DIR             = GDMA_DIR_MemoryToPeripheral;
 *     GDMA_InitStruct.GDMA_BufferSize      = UART_TX_GDMA_BUFFER_SIZE;//determine total transfer size
 *     GDMA_InitStruct.GDMA_SourceInc       = DMA_SourceInc_Inc;
 *     GDMA_InitStruct.GDMA_DestinationInc  = DMA_DestinationInc_Fix;
 *     GDMA_InitStruct.GDMA_SourceDataSize  = GDMA_DataSize_Byte;
 *     GDMA_InitStruct.GDMA_DestinationDataSize = GDMA_DataSize_Byte;
 *     GDMA_InitStruct.GDMA_SourceMsize      = GDMA_Msize_1;
 *     GDMA_InitStruct.GDMA_DestinationMsize = GDMA_Msize_1;
 *     GDMA_InitStruct.GDMA_SourceAddr      = (uint32_t)GDMA_SendData_Buffer;
 *     GDMA_InitStruct.GDMA_DestinationAddr = (uint32_t)(&(UART0->RB_THR));
 *     GDMA_InitStruct.GDMA_DestHandshake   = GDMA_Handshake_UART0_TX;
 *     GDMA_InitStruct.GDMA_ChannelPriority = 2;//channel prority between 0 to 5
 *     GDMA_Init(UART_TX_GDMA_CHANNEL, &GDMA_InitStruct);
 *
 * }
 * \endcode
 */
void GDMA_StructInit(GDMA_InitTypeDef *GDMA_InitStruct);

/**
 * \brief  Enables or disables the selected GDMA channel.
 * \param[in]  GDMA_Channel_Num: GDMA channel number, can be 0~5.
 * \param[in]  NewState: New state of the selected DMA channel.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_gdma_init(void)
 * {
 *
 *     for (uint32_t i = 0; i < UART_TX_GDMA_BUFFER_SIZE; i++)
 *     {
 *         GDMA_SendData_Buffer[i] = 0x10 + i;
 *     }

