ART-Badge/SDK/bsp_for_art-badge/libraries/inc/peripheral/rtl876x_gdma.h
    /* Return the transfer interrupt status */
    return  bit_status;
}

/**
 * \brief   Clear GDMA Channelx all interrupt.
 * \param[in] GDMA_Channel_Num: GDMA channel number, can be 0~5.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     GDMA_ClearAllTypeINT(0);
 * }
 * \endcode
 */
__STATIC_INLINE void GDMA_ClearAllTypeINT(uint8_t GDMA_Channel_Num)
{
    /* Check the parameters */
    assert_param(IS_GDMA_ChannelNum(GDMA_Channel_Num));

    GDMA_BASE->CLEAR_TFR = BIT(GDMA_Channel_Num);
    GDMA_BASE->CLEAR_BLOCK = BIT(GDMA_Channel_Num);
    GDMA_BASE->CLEAR_DST_TRAN = BIT(GDMA_Channel_Num);
    GDMA_BASE->CLEAR_SRC_TRAN = BIT(GDMA_Channel_Num);
    GDMA_BASE->CLEAR_ERR = BIT(GDMA_Channel_Num);
}

/**
 * \brief  set GDMA transmission source address.
 * \param[in]  GDMA_Channelx: where x can be 0 to 5 to select the DMA Channel.
 * \param[in]  Address: Source address.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     uint32_t data_buf[10] = {0};
 *     GDMA_SetSourceAddress(GDMA_Channel0,(uint32_t)data_buf);
 * }
 * \endcode
 */
__STATIC_INLINE void GDMA_SetSourceAddress(GDMA_ChannelTypeDef *GDMA_Channelx, uint32_t Address)
{
    /* Check the parameters */
    assert_param(IS_GDMA_ALL_PERIPH(GDMA_Channelx));

    GDMA_Channelx->SAR = Address;
}

/**
 * \brief  Set GDMA transmission destination address.
 * \param[in] GDMA_Channelx: Where x can be 0 to 5  to select the GDMA Channel.
 * \param[in] Address: Destination address.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     uint32_t data_buf[10] = {0};
 *     GDMA_SetDestinationAddress(GDMA_Channel0,(uint32_t)data_buf);
 * }
 * \endcode
 */
__STATIC_INLINE void GDMA_SetDestinationAddress(GDMA_ChannelTypeDef *GDMA_Channelx,
                                                uint32_t Address)
{
    /* Check the parameters */
    assert_param(IS_GDMA_ALL_PERIPH(GDMA_Channelx));

    GDMA_Channelx->DAR = Address;
}

/**
 * \brief   Set GDMA buffer size.
 * \param[in] GDMA_Channelx: Where x can be 0 to 5 to select the GDMA Channel.
 * \param[in] buffer_size: Set GDMA_BufferSize.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     uint32_t data_buf_size = 4095;//max
 *     GDMA_SetBufferSize(GDMA_Channel0,data_buf_size);
 * }
 * \endcode
 */
__STATIC_INLINE void GDMA_SetBufferSize(GDMA_ChannelTypeDef *GDMA_Channelx, uint32_t buffer_size)
{
    /* Check the parameters */
    assert_param(IS_GDMA_ALL_PERIPH(GDMA_Channelx));

    /* configure high 32 bit of CTL register */
    GDMA_Channelx->CTL_HIGH = buffer_size;
}

/**
 * \brief  Suspend GDMA transmission from the source.
 * \param[in]  GDMA_Channelx: Where x can be 0 to 5 to select the GDMA Channel.
 * \param[in]  NewState: New state of the DMA Channelx.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 * \note    To prevent data loss, it is necessary to check whether FIFO data transmission is completed
 *          after suspend, and judge by checking whether GDMA FIFO is empty.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     GDMA_SuspendCmd(GDMA_Channel0,ENABLE);
 * }
 * \endcode
 */
__STATIC_INLINE void GDMA_SuspendCmd(GDMA_ChannelTypeDef *GDMA_Channelx,
                                     FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_GDMA_ALL_PERIPH(GDMA_Channelx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == DISABLE)
    {
        /* Not suspend transmission*/
        GDMA_Channelx->CFG_LOW &= ~(GDMA_SUSPEND_TRANSMISSSION);
    }
    else
    {
        /* Suspend transmission */
        GDMA_Channelx->CFG_LOW |= GDMA_SUSPEND_TRANSMISSSION;
    }
}

/**
 * \brief  Get GDMA transfer data length.
 * \param[in] GDMA_Channelx: Where x can be 0 to 5 to select the GDMA Channel.
 * \return GDMA transfer data length.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     uint16_t data_len = GDMA_GetTransferLen(GDMA_Channel0);
 * }
 * \endcode
 */
__STATIC_INLINE uint16_t GDMA_GetTransferLen(GDMA_ChannelTypeDef *GDMA_Channelx)
{
    /* Check the parameters */
    assert_param(IS_GDMA_ALL_PERIPH(GDMA_Channelx));

    return (uint16_t)(GDMA_Channelx->CTL_HIGH & 0xfff);
}

/**
 * \brief  Set GDMA LLP stucture address.
 * \param[in] GDMA_Channelx: Only for GDMA_Channel0~4.
 * \param[in] Address: LLP stucture address.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     GDMA_LLIDef GDMA_LLIStruct[4000];
 *     GDMA_SetLLPAddress(GDMA_Channel0,(uint32_t)GDMA_LLIStruct);
 * }
 * \endcode
 */
__STATIC_INLINE void GDMA_SetLLPAddress(GDMA_ChannelTypeDef *GDMA_Channelx, uint32_t Address)
{
    /* Check the parameters */
    assert_param(IS_GDMA_ALL_PERIPH(GDMA_Channelx));

    if ((GDMA_Channelx == GDMA_Channel0) | (GDMA_Channelx == GDMA_Channel1) | \
        (GDMA_Channelx == GDMA_Channel2) | (GDMA_Channelx == GDMA_Channel3))
    {
        GDMA_Channelx->LLP = Address;
    }
}

/**
 * \brief  Check GDMA suspend channel status.
 * \param[in] GDMA_Channelx: Where x can be 0 to 5 to select the GDMA Channel.
 * \return GDMA suspend channel status.
 * \retval SET: Inactive.
 * \retval RESET: Active.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     FlagStatus flag_status = GDMA_GetSuspendChannelStatus(GDMA_Channel0);
 * }
 * \endcode
 */
__STATIC_INLINE FlagStatus GDMA_GetSuspendChannelStatus(GDMA_ChannelTypeDef *GDMA_Channelx)
{
    FlagStatus bit_status = RESET;

    /* Check the parameters */
    assert_param(IS_GDMA_ALL_PERIPH(GDMA_Channelx));

    if ((GDMA_Channelx->CFG_LOW & GDMA_SUSPEND_CHANNEL_STATUS) == GDMA_SUSPEND_CHANNEL_STATUS)
    {
        bit_status = SET;
    }

    /* Return the selected channel suspend status */
    return  bit_status;
}

/**
 * \brief  Check GDMA suspend command status.
 * \param  GDMA_Channelx: Where x can be 0 to 5 to select the GDMA Channel.
 * \return GDMA suspend command status.
 * \retval SET: Suspend.
 * \retval RESET: Not suspend.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     FlagStatus flag_status = GDMA_GetSuspendCmdStatus(GDMA_Channel0);
 * }
 * \endcode
 */
__STATIC_INLINE FlagStatus GDMA_GetSuspendCmdStatus(GDMA_ChannelTypeDef *GDMA_Channelx)
{
    FlagStatus bit_status = RESET;

    /* Check the parameters */
    assert_param(IS_GDMA_ALL_PERIPH(GDMA_Channelx));

    if ((GDMA_Channelx->CFG_LOW & GDMA_SUSPEND_CMD_STATUS) == GDMA_SUSPEND_CMD_STATUS)
    {
        bit_status = SET;
    }

    /* Return the selected channel suspend status */
    return  bit_status;
}

/**
 * \brief  Check GDMA FIFO status.
 * \param[in] GDMA_Channelx: Where x can be 0 to 5 to select the GDMA Channel.
 * \return GDMA FIFO status.
 * \retval SET: FIFO empty.
 * \retval RESET: FIFO not empty.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     FlagStatus flag_status = GDMA_GetFIFOStatus(GDMA_Channel0);
 * }
 * \endcode
 */
__STATIC_INLINE FlagStatus GDMA_GetFIFOStatus(GDMA_ChannelTypeDef *GDMA_Channelx)
{
    FlagStatus bit_status = RESET;

    /* Check the parameters */
    assert_param(IS_GDMA_ALL_PERIPH(GDMA_Channelx));

    if ((GDMA_Channelx->CFG_LOW & GDMA_FIFO_STATUS) != (uint32_t)RESET)
    {

        bit_status = SET;
    }

    /* Return the selected channel status */
    return  bit_status;
}

/**
 * \brief  Get GDMA source address.
 * \param[in] GDMA_Channelx: Where x can be 0 to 5 to select the DMA Channel.
 * \return Source address.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     uint32_t address = GDMA_GetSrcTransferAddress(GDMA_Channel0);
 * }
 * \endcode
 */
__STATIC_INLINE uint32_t GDMA_GetSrcTransferAddress(GDMA_ChannelTypeDef *GDMA_Channelx)
{
    /* Check the parameters */
    assert_param(IS_GDMA_ALL_PERIPH(GDMA_Channelx));

    uint32_t address = 0;
    address = GDMA_Channelx->SAR;
    return address;
}

/**
 * \brief  Get GDMA destination address.
 * \param[in] GDMA_Channelx: Where x can be 0 to 5 to select the DMA Channel.
 * \return Destination address.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gdma_demo(void)
 * {
 *     uint32_t address = GDMA_GetDstTransferAddress(GDMA_Channel0);
 * }
 * \endcode
 */
__STATIC_INLINE uint32_t GDMA_GetDstTransferAddress(GDMA_ChannelTypeDef *GDMA_Channelx)
{
    /* Check the parameters */
    assert_param(IS_GDMA_ALL_PERIPH(GDMA_Channelx));

    uint32_t address = 0;
    address = GDMA_Channelx->DAR;
    return address;
}

/** \} */ /* End of group GDMA_Exported_Functions */

#ifdef __cplusplus
}
#endif

#endif /*_RTL8762X_GDMA_H_*/


/******************* (C) COPYRIGHT 2019 Realtek Semiconductor Corporation *****END OF FILE****/

